Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/GHS_Test/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxDmu_bf.h
/** \brief Length for Ifx_DMU_HF_ECCR_Bits.RCODE */
#define IFX_DMU_HF_ECCR_RCODE_LEN (22u)

/** \brief Mask for Ifx_DMU_HF_ECCR_Bits.RCODE */
#define IFX_DMU_HF_ECCR_RCODE_MSK (0x3fffffu)

/** \brief Offset for Ifx_DMU_HF_ECCR_Bits.RCODE */
#define IFX_DMU_HF_ECCR_RCODE_OFF (0u)

/** \brief Length for Ifx_DMU_HF_ECCS_Bits.ERR1 */
#define IFX_DMU_HF_ECCS_ERR1_LEN (1u)

/** \brief Mask for Ifx_DMU_HF_ECCS_Bits.ERR1 */
#define IFX_DMU_HF_ECCS_ERR1_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HF_ECCS_Bits.ERR1 */
#define IFX_DMU_HF_ECCS_ERR1_OFF (0u)

/** \brief Length for Ifx_DMU_HF_ECCS_Bits.ERR2 */
#define IFX_DMU_HF_ECCS_ERR2_LEN (1u)

/** \brief Mask for Ifx_DMU_HF_ECCS_Bits.ERR2 */
#define IFX_DMU_HF_ECCS_ERR2_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HF_ECCS_Bits.ERR2 */
#define IFX_DMU_HF_ECCS_ERR2_OFF (1u)

/** \brief Length for Ifx_DMU_HF_ECCS_Bits.ERR3 */
#define IFX_DMU_HF_ECCS_ERR3_LEN (1u)

/** \brief Mask for Ifx_DMU_HF_ECCS_Bits.ERR3 */
#define IFX_DMU_HF_ECCS_ERR3_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HF_ECCS_Bits.ERR3 */
#define IFX_DMU_HF_ECCS_ERR3_OFF (2u)

/** \brief Length for Ifx_DMU_HF_ECCS_Bits.ERRM */
#define IFX_DMU_HF_ECCS_ERRM_LEN (1u)

/** \brief Mask for Ifx_DMU_HF_ECCS_Bits.ERRM */
#define IFX_DMU_HF_ECCS_ERRM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HF_ECCS_Bits.ERRM */
#define IFX_DMU_HF_ECCS_ERRM_OFF (3u)

/** \brief Length for Ifx_DMU_HF_ECCS_Bits.ERRANY */
#define IFX_DMU_HF_ECCS_ERRANY_LEN (1u)

/** \brief Mask for Ifx_DMU_HF_ECCS_Bits.ERRANY */
#define IFX_DMU_HF_ECCS_ERRANY_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HF_ECCS_Bits.ERRANY */
#define IFX_DMU_HF_ECCS_ERRANY_OFF (7u)

/** \brief Length for Ifx_DMU_HF_ECCS_Bits.BLANKA */
#define IFX_DMU_HF_ECCS_BLANKA_LEN (1u)

/** \brief Mask for Ifx_DMU_HF_ECCS_Bits.BLANKA */
#define IFX_DMU_HF_ECCS_BLANKA_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HF_ECCS_Bits.BLANKA */
#define IFX_DMU_HF_ECCS_BLANKA_OFF (9u)

/** \brief Length for Ifx_DMU_HF_ECCS_Bits.AER1 */
#define IFX_DMU_HF_ECCS_AER1_LEN (1u)

/** \brief Mask for Ifx_DMU_HF_ECCS_Bits.AER1 */
#define IFX_DMU_HF_ECCS_AER1_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HF_ECCS_Bits.AER1 */
#define IFX_DMU_HF_ECCS_AER1_OFF (16u)

/** \brief Length for Ifx_DMU_HF_ECCS_Bits.AER2 */
#define IFX_DMU_HF_ECCS_AER2_LEN (1u)

/** \brief Mask for Ifx_DMU_HF_ECCS_Bits.AER2 */
#define IFX_DMU_HF_ECCS_AER2_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HF_ECCS_Bits.AER2 */
#define IFX_DMU_HF_ECCS_AER2_OFF (17u)

/** \brief Length for Ifx_DMU_HF_ECCS_Bits.AER3 */
#define IFX_DMU_HF_ECCS_AER3_LEN (1u)

/** \brief Mask for Ifx_DMU_HF_ECCS_Bits.AER3 */
#define IFX_DMU_HF_ECCS_AER3_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HF_ECCS_Bits.AER3 */
#define IFX_DMU_HF_ECCS_AER3_OFF (18u)

/** \brief Length for Ifx_DMU_HF_ECCS_Bits.AERM */
#define IFX_DMU_HF_ECCS_AERM_LEN (1u)

/** \brief Mask for Ifx_DMU_HF_ECCS_Bits.AERM */
#define IFX_DMU_HF_ECCS_AERM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HF_ECCS_Bits.AERM */
#define IFX_DMU_HF_ECCS_AERM_OFF (19u)

/** \brief Length for Ifx_DMU_HF_ECCS_Bits.AERANY */
#define IFX_DMU_HF_ECCS_AERANY_LEN (1u)

/** \brief Mask for Ifx_DMU_HF_ECCS_Bits.AERANY */
#define IFX_DMU_HF_ECCS_AERANY_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HF_ECCS_Bits.AERANY */
#define IFX_DMU_HF_ECCS_AERANY_OFF (23u)

/** \brief Length for Ifx_DMU_HF_ECCS_Bits.ABLANKA */
#define IFX_DMU_HF_ECCS_ABLANKA_LEN (1u)

/** \brief Mask for Ifx_DMU_HF_ECCS_Bits.ABLANKA */
#define IFX_DMU_HF_ECCS_ABLANKA_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HF_ECCS_Bits.ABLANKA */
#define IFX_DMU_HF_ECCS_ABLANKA_OFF (25u)

/** \brief Length for Ifx_DMU_HF_ECCC_Bits.CLR */
#define IFX_DMU_HF_ECCC_CLR_LEN (2u)

/** \brief Mask for Ifx_DMU_HF_ECCC_Bits.CLR */
#define IFX_DMU_HF_ECCC_CLR_MSK (0x3u)

/** \brief Offset for Ifx_DMU_HF_ECCC_Bits.CLR */
#define IFX_DMU_HF_ECCC_CLR_OFF (0u)

/** \brief Length for Ifx_DMU_HF_ECCC_Bits.ECCCORDIS */
#define IFX_DMU_HF_ECCC_ECCCORDIS_LEN (2u)

/** \brief Mask for Ifx_DMU_HF_ECCC_Bits.ECCCORDIS */
#define IFX_DMU_HF_ECCC_ECCCORDIS_MSK (0x3u)

/** \brief Offset for Ifx_DMU_HF_ECCC_Bits.ECCCORDIS */
#define IFX_DMU_HF_ECCC_ECCCORDIS_OFF (28u)

/** \brief Length for Ifx_DMU_HF_ECCC_Bits.TRAPDIS */
#define IFX_DMU_HF_ECCC_TRAPDIS_LEN (2u)

/** \brief Mask for Ifx_DMU_HF_ECCC_Bits.TRAPDIS */
#define IFX_DMU_HF_ECCC_TRAPDIS_MSK (0x3u)

/** \brief Offset for Ifx_DMU_HF_ECCC_Bits.TRAPDIS */
#define IFX_DMU_HF_ECCC_TRAPDIS_OFF (30u)

/** \brief Length for Ifx_DMU_HF_ECCW_Bits.WCODE */
#define IFX_DMU_HF_ECCW_WCODE_LEN (22u)

/** \brief Mask for Ifx_DMU_HF_ECCW_Bits.WCODE */
#define IFX_DMU_HF_ECCW_WCODE_MSK (0x3fffffu)

/** \brief Offset for Ifx_DMU_HF_ECCW_Bits.WCODE */
#define IFX_DMU_HF_ECCW_WCODE_OFF (0u)

/** \brief Length for Ifx_DMU_HF_ECCW_Bits.PECENCDIS */
#define IFX_DMU_HF_ECCW_PECENCDIS_LEN (2u)

/** \brief Mask for Ifx_DMU_HF_ECCW_Bits.PECENCDIS */
#define IFX_DMU_HF_ECCW_PECENCDIS_MSK (0x3u)

/** \brief Offset for Ifx_DMU_HF_ECCW_Bits.PECENCDIS */
#define IFX_DMU_HF_ECCW_PECENCDIS_OFF (28u)

/** \brief Length for Ifx_DMU_HF_ECCW_Bits.DECENCDIS */
#define IFX_DMU_HF_ECCW_DECENCDIS_LEN (2u)

/** \brief Mask for Ifx_DMU_HF_ECCW_Bits.DECENCDIS */
#define IFX_DMU_HF_ECCW_DECENCDIS_MSK (0x3u)

/** \brief Offset for Ifx_DMU_HF_ECCW_Bits.DECENCDIS */
#define IFX_DMU_HF_ECCW_DECENCDIS_OFF (30u)

/** \brief Length for Ifx_DMU_HF_CCONTROL_Bits.CRANKING */
#define IFX_DMU_HF_CCONTROL_CRANKING_LEN (2u)

/** \brief Mask for Ifx_DMU_HF_CCONTROL_Bits.CRANKING */
#define IFX_DMU_HF_CCONTROL_CRANKING_MSK (0x3u)

/** \brief Offset for Ifx_DMU_HF_CCONTROL_Bits.CRANKING */
#define IFX_DMU_HF_CCONTROL_CRANKING_OFF (0u)

/** \brief Length for Ifx_DMU_HF_PSTATUS_Bits.SLEEP */
#define IFX_DMU_HF_PSTATUS_SLEEP_LEN (1u)

/** \brief Mask for Ifx_DMU_HF_PSTATUS_Bits.SLEEP */
#define IFX_DMU_HF_PSTATUS_SLEEP_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HF_PSTATUS_Bits.SLEEP */
#define IFX_DMU_HF_PSTATUS_SLEEP_OFF (0u)

/** \brief Length for Ifx_DMU_HF_PSTATUS_Bits.IDLE */
#define IFX_DMU_HF_PSTATUS_IDLE_LEN (1u)

/** \brief Mask for Ifx_DMU_HF_PSTATUS_Bits.IDLE */
#define IFX_DMU_HF_PSTATUS_IDLE_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HF_PSTATUS_Bits.IDLE */
#define IFX_DMU_HF_PSTATUS_IDLE_OFF (1u)

