Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/GHS_Test/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxDmu_bf.h
/** \brief Length for Ifx_DMU_HF_PSTATUS_Bits.DEMAND */
#define IFX_DMU_HF_PSTATUS_DEMAND_LEN (1u)

/** \brief Mask for Ifx_DMU_HF_PSTATUS_Bits.DEMAND */
#define IFX_DMU_HF_PSTATUS_DEMAND_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HF_PSTATUS_Bits.DEMAND */
#define IFX_DMU_HF_PSTATUS_DEMAND_OFF (2u)

/** \brief Length for Ifx_DMU_HF_PCONTROL_Bits.SLEEP */
#define IFX_DMU_HF_PCONTROL_SLEEP_LEN (2u)

/** \brief Mask for Ifx_DMU_HF_PCONTROL_Bits.SLEEP */
#define IFX_DMU_HF_PCONTROL_SLEEP_MSK (0x3u)

/** \brief Offset for Ifx_DMU_HF_PCONTROL_Bits.SLEEP */
#define IFX_DMU_HF_PCONTROL_SLEEP_OFF (0u)

/** \brief Length for Ifx_DMU_HF_PCONTROL_Bits.IDLE */
#define IFX_DMU_HF_PCONTROL_IDLE_LEN (2u)

/** \brief Mask for Ifx_DMU_HF_PCONTROL_Bits.IDLE */
#define IFX_DMU_HF_PCONTROL_IDLE_MSK (0x3u)

/** \brief Offset for Ifx_DMU_HF_PCONTROL_Bits.IDLE */
#define IFX_DMU_HF_PCONTROL_IDLE_OFF (8u)

/** \brief Length for Ifx_DMU_HF_PCONTROL_Bits.DEMAND */
#define IFX_DMU_HF_PCONTROL_DEMAND_LEN (2u)

/** \brief Mask for Ifx_DMU_HF_PCONTROL_Bits.DEMAND */
#define IFX_DMU_HF_PCONTROL_DEMAND_MSK (0x3u)

/** \brief Offset for Ifx_DMU_HF_PCONTROL_Bits.DEMAND */
#define IFX_DMU_HF_PCONTROL_DEMAND_OFF (10u)

/** \brief Length for Ifx_DMU_HF_PCONTROL_Bits.ESLDIS */
#define IFX_DMU_HF_PCONTROL_ESLDIS_LEN (2u)

/** \brief Mask for Ifx_DMU_HF_PCONTROL_Bits.ESLDIS */
#define IFX_DMU_HF_PCONTROL_ESLDIS_MSK (0x3u)

/** \brief Offset for Ifx_DMU_HF_PCONTROL_Bits.ESLDIS */
#define IFX_DMU_HF_PCONTROL_ESLDIS_OFF (16u)

/** \brief Length for Ifx_DMU_HF_PCONTROL_Bits.PR5V */
#define IFX_DMU_HF_PCONTROL_PR5V_LEN (2u)

/** \brief Mask for Ifx_DMU_HF_PCONTROL_Bits.PR5V */
#define IFX_DMU_HF_PCONTROL_PR5V_MSK (0x3u)

/** \brief Offset for Ifx_DMU_HF_PCONTROL_Bits.PR5V */
#define IFX_DMU_HF_PCONTROL_PR5V_OFF (30u)

/** \brief Length for Ifx_DMU_HF_PWAIT_Bits.RFLASH */
#define IFX_DMU_HF_PWAIT_RFLASH_LEN (6u)

/** \brief Mask for Ifx_DMU_HF_PWAIT_Bits.RFLASH */
#define IFX_DMU_HF_PWAIT_RFLASH_MSK (0x3fu)

/** \brief Offset for Ifx_DMU_HF_PWAIT_Bits.RFLASH */
#define IFX_DMU_HF_PWAIT_RFLASH_OFF (0u)

/** \brief Length for Ifx_DMU_HF_PWAIT_Bits.RECC */
#define IFX_DMU_HF_PWAIT_RECC_LEN (3u)

/** \brief Mask for Ifx_DMU_HF_PWAIT_Bits.RECC */
#define IFX_DMU_HF_PWAIT_RECC_MSK (0x7u)

/** \brief Offset for Ifx_DMU_HF_PWAIT_Bits.RECC */
#define IFX_DMU_HF_PWAIT_RECC_OFF (8u)

/** \brief Length for Ifx_DMU_HF_PWAIT_Bits.CFLASH */
#define IFX_DMU_HF_PWAIT_CFLASH_LEN (6u)

/** \brief Mask for Ifx_DMU_HF_PWAIT_Bits.CFLASH */
#define IFX_DMU_HF_PWAIT_CFLASH_MSK (0x3fu)

/** \brief Offset for Ifx_DMU_HF_PWAIT_Bits.CFLASH */
#define IFX_DMU_HF_PWAIT_CFLASH_OFF (16u)

/** \brief Length for Ifx_DMU_HF_PWAIT_Bits.CECC */
#define IFX_DMU_HF_PWAIT_CECC_LEN (3u)

/** \brief Mask for Ifx_DMU_HF_PWAIT_Bits.CECC */
#define IFX_DMU_HF_PWAIT_CECC_MSK (0x7u)

/** \brief Offset for Ifx_DMU_HF_PWAIT_Bits.CECC */
#define IFX_DMU_HF_PWAIT_CECC_OFF (24u)

/** \brief Length for Ifx_DMU_HF_DWAIT_Bits.RFLASH */
#define IFX_DMU_HF_DWAIT_RFLASH_LEN (8u)

/** \brief Mask for Ifx_DMU_HF_DWAIT_Bits.RFLASH */
#define IFX_DMU_HF_DWAIT_RFLASH_MSK (0xffu)

/** \brief Offset for Ifx_DMU_HF_DWAIT_Bits.RFLASH */
#define IFX_DMU_HF_DWAIT_RFLASH_OFF (0u)

/** \brief Length for Ifx_DMU_HF_DWAIT_Bits.RECC */
#define IFX_DMU_HF_DWAIT_RECC_LEN (3u)

/** \brief Mask for Ifx_DMU_HF_DWAIT_Bits.RECC */
#define IFX_DMU_HF_DWAIT_RECC_MSK (0x7u)

/** \brief Offset for Ifx_DMU_HF_DWAIT_Bits.RECC */
#define IFX_DMU_HF_DWAIT_RECC_OFF (16u)

/** \brief Length for Ifx_DMU_HF_PROCONUSR_Bits.MODE */
#define IFX_DMU_HF_PROCONUSR_MODE_LEN (2u)

/** \brief Mask for Ifx_DMU_HF_PROCONUSR_Bits.MODE */
#define IFX_DMU_HF_PROCONUSR_MODE_MSK (0x3u)

/** \brief Offset for Ifx_DMU_HF_PROCONUSR_Bits.MODE */
#define IFX_DMU_HF_PROCONUSR_MODE_OFF (0u)

/** \brief Length for Ifx_DMU_HF_PROCONPF_Bits.RPRO */
#define IFX_DMU_HF_PROCONPF_RPRO_LEN (1u)

/** \brief Mask for Ifx_DMU_HF_PROCONPF_Bits.RPRO */
#define IFX_DMU_HF_PROCONPF_RPRO_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HF_PROCONPF_Bits.RPRO */
#define IFX_DMU_HF_PROCONPF_RPRO_OFF (31u)

/** \brief Length for Ifx_DMU_HF_PROCONTP_Bits.TP */
#define IFX_DMU_HF_PROCONTP_TP_LEN (1u)

/** \brief Mask for Ifx_DMU_HF_PROCONTP_Bits.TP */
#define IFX_DMU_HF_PROCONTP_TP_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HF_PROCONTP_Bits.TP */
#define IFX_DMU_HF_PROCONTP_TP_OFF (0u)

/** \brief Length for Ifx_DMU_HF_PROCONTP_Bits.BML */
#define IFX_DMU_HF_PROCONTP_BML_LEN (2u)

/** \brief Mask for Ifx_DMU_HF_PROCONTP_Bits.BML */
#define IFX_DMU_HF_PROCONTP_BML_MSK (0x3u)

/** \brief Offset for Ifx_DMU_HF_PROCONTP_Bits.BML */
#define IFX_DMU_HF_PROCONTP_BML_OFF (8u)

/** \brief Length for Ifx_DMU_HF_PROCONTP_Bits.SWAPEN */
#define IFX_DMU_HF_PROCONTP_SWAPEN_LEN (2u)

/** \brief Mask for Ifx_DMU_HF_PROCONTP_Bits.SWAPEN */
#define IFX_DMU_HF_PROCONTP_SWAPEN_MSK (0x3u)

/** \brief Offset for Ifx_DMU_HF_PROCONTP_Bits.SWAPEN */
#define IFX_DMU_HF_PROCONTP_SWAPEN_OFF (16u)

/** \brief Length for Ifx_DMU_HF_PROCONTP_Bits.CPU0DDIS */
#define IFX_DMU_HF_PROCONTP_CPU0DDIS_LEN (1u)

/** \brief Mask for Ifx_DMU_HF_PROCONTP_Bits.CPU0DDIS */
#define IFX_DMU_HF_PROCONTP_CPU0DDIS_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HF_PROCONTP_Bits.CPU0DDIS */
#define IFX_DMU_HF_PROCONTP_CPU0DDIS_OFF (18u)

/** \brief Length for Ifx_DMU_HF_PROCONTP_Bits.CPU1DDIS */
#define IFX_DMU_HF_PROCONTP_CPU1DDIS_LEN (1u)

/** \brief Mask for Ifx_DMU_HF_PROCONTP_Bits.CPU1DDIS */
#define IFX_DMU_HF_PROCONTP_CPU1DDIS_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HF_PROCONTP_Bits.CPU1DDIS */
#define IFX_DMU_HF_PROCONTP_CPU1DDIS_OFF (19u)

/** \brief Length for Ifx_DMU_HF_PROCONTP_Bits.CPU2DDIS */
#define IFX_DMU_HF_PROCONTP_CPU2DDIS_LEN (1u)

/** \brief Mask for Ifx_DMU_HF_PROCONTP_Bits.CPU2DDIS */
#define IFX_DMU_HF_PROCONTP_CPU2DDIS_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HF_PROCONTP_Bits.CPU2DDIS */
#define IFX_DMU_HF_PROCONTP_CPU2DDIS_OFF (20u)

/** \brief Length for Ifx_DMU_HF_PROCONTP_Bits.CPU3DDIS */
#define IFX_DMU_HF_PROCONTP_CPU3DDIS_LEN (1u)

/** \brief Mask for Ifx_DMU_HF_PROCONTP_Bits.CPU3DDIS */
#define IFX_DMU_HF_PROCONTP_CPU3DDIS_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HF_PROCONTP_Bits.CPU3DDIS */
#define IFX_DMU_HF_PROCONTP_CPU3DDIS_OFF (21u)

/** \brief Length for Ifx_DMU_HF_PROCONTP_Bits.CPU4DDIS */
#define IFX_DMU_HF_PROCONTP_CPU4DDIS_LEN (1u)

/** \brief Mask for Ifx_DMU_HF_PROCONTP_Bits.CPU4DDIS */
#define IFX_DMU_HF_PROCONTP_CPU4DDIS_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HF_PROCONTP_Bits.CPU4DDIS */
#define IFX_DMU_HF_PROCONTP_CPU4DDIS_OFF (22u)

/** \brief Length for Ifx_DMU_HF_PROCONTP_Bits.CPU5DDIS */
#define IFX_DMU_HF_PROCONTP_CPU5DDIS_LEN (1u)

/** \brief Mask for Ifx_DMU_HF_PROCONTP_Bits.CPU5DDIS */
#define IFX_DMU_HF_PROCONTP_CPU5DDIS_MSK (0x1u)

