Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/GHS_Test/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxDmu_bf.h
/** \brief Length for Ifx_DMU_HP_PROCON_OTP5_Bits.S182ROM */
#define IFX_DMU_HP_PROCON_OTP5_S182ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP5_Bits.S182ROM */
#define IFX_DMU_HP_PROCON_OTP5_S182ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP5_Bits.S182ROM */
#define IFX_DMU_HP_PROCON_OTP5_S182ROM_OFF (22u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP5_Bits.S183ROM */
#define IFX_DMU_HP_PROCON_OTP5_S183ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP5_Bits.S183ROM */
#define IFX_DMU_HP_PROCON_OTP5_S183ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP5_Bits.S183ROM */
#define IFX_DMU_HP_PROCON_OTP5_S183ROM_OFF (23u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP5_Bits.S184ROM */
#define IFX_DMU_HP_PROCON_OTP5_S184ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP5_Bits.S184ROM */
#define IFX_DMU_HP_PROCON_OTP5_S184ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP5_Bits.S184ROM */
#define IFX_DMU_HP_PROCON_OTP5_S184ROM_OFF (24u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP5_Bits.S185ROM */
#define IFX_DMU_HP_PROCON_OTP5_S185ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP5_Bits.S185ROM */
#define IFX_DMU_HP_PROCON_OTP5_S185ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP5_Bits.S185ROM */
#define IFX_DMU_HP_PROCON_OTP5_S185ROM_OFF (25u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP5_Bits.S186ROM */
#define IFX_DMU_HP_PROCON_OTP5_S186ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP5_Bits.S186ROM */
#define IFX_DMU_HP_PROCON_OTP5_S186ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP5_Bits.S186ROM */
#define IFX_DMU_HP_PROCON_OTP5_S186ROM_OFF (26u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP5_Bits.S187ROM */
#define IFX_DMU_HP_PROCON_OTP5_S187ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP5_Bits.S187ROM */
#define IFX_DMU_HP_PROCON_OTP5_S187ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP5_Bits.S187ROM */
#define IFX_DMU_HP_PROCON_OTP5_S187ROM_OFF (27u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP5_Bits.S188ROM */
#define IFX_DMU_HP_PROCON_OTP5_S188ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP5_Bits.S188ROM */
#define IFX_DMU_HP_PROCON_OTP5_S188ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP5_Bits.S188ROM */
#define IFX_DMU_HP_PROCON_OTP5_S188ROM_OFF (28u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP5_Bits.S189ROM */
#define IFX_DMU_HP_PROCON_OTP5_S189ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP5_Bits.S189ROM */
#define IFX_DMU_HP_PROCON_OTP5_S189ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP5_Bits.S189ROM */
#define IFX_DMU_HP_PROCON_OTP5_S189ROM_OFF (29u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP5_Bits.S190ROM */
#define IFX_DMU_HP_PROCON_OTP5_S190ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP5_Bits.S190ROM */
#define IFX_DMU_HP_PROCON_OTP5_S190ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP5_Bits.S190ROM */
#define IFX_DMU_HP_PROCON_OTP5_S190ROM_OFF (30u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP5_Bits.S191ROM */
#define IFX_DMU_HP_PROCON_OTP5_S191ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP5_Bits.S191ROM */
#define IFX_DMU_HP_PROCON_OTP5_S191ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP5_Bits.S191ROM */
#define IFX_DMU_HP_PROCON_OTP5_S191ROM_OFF (31u)

/** \brief Length for Ifx_DMU_HP_PROCON_WOP0_Bits.S0WOP */
#define IFX_DMU_HP_PROCON_WOP0_S0WOP_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_WOP0_Bits.S0WOP */
#define IFX_DMU_HP_PROCON_WOP0_S0WOP_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_WOP0_Bits.S0WOP */
#define IFX_DMU_HP_PROCON_WOP0_S0WOP_OFF (0u)

/** \brief Length for Ifx_DMU_HP_PROCON_WOP0_Bits.S1WOP */
#define IFX_DMU_HP_PROCON_WOP0_S1WOP_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_WOP0_Bits.S1WOP */
#define IFX_DMU_HP_PROCON_WOP0_S1WOP_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_WOP0_Bits.S1WOP */
#define IFX_DMU_HP_PROCON_WOP0_S1WOP_OFF (1u)

/** \brief Length for Ifx_DMU_HP_PROCON_WOP0_Bits.S2WOP */
#define IFX_DMU_HP_PROCON_WOP0_S2WOP_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_WOP0_Bits.S2WOP */
#define IFX_DMU_HP_PROCON_WOP0_S2WOP_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_WOP0_Bits.S2WOP */
#define IFX_DMU_HP_PROCON_WOP0_S2WOP_OFF (2u)

/** \brief Length for Ifx_DMU_HP_PROCON_WOP0_Bits.S3WOP */
#define IFX_DMU_HP_PROCON_WOP0_S3WOP_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_WOP0_Bits.S3WOP */
#define IFX_DMU_HP_PROCON_WOP0_S3WOP_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_WOP0_Bits.S3WOP */
#define IFX_DMU_HP_PROCON_WOP0_S3WOP_OFF (3u)

/** \brief Length for Ifx_DMU_HP_PROCON_WOP0_Bits.S4WOP */
#define IFX_DMU_HP_PROCON_WOP0_S4WOP_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_WOP0_Bits.S4WOP */
#define IFX_DMU_HP_PROCON_WOP0_S4WOP_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_WOP0_Bits.S4WOP */
#define IFX_DMU_HP_PROCON_WOP0_S4WOP_OFF (4u)

/** \brief Length for Ifx_DMU_HP_PROCON_WOP0_Bits.S5WOP */
#define IFX_DMU_HP_PROCON_WOP0_S5WOP_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_WOP0_Bits.S5WOP */
#define IFX_DMU_HP_PROCON_WOP0_S5WOP_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_WOP0_Bits.S5WOP */
#define IFX_DMU_HP_PROCON_WOP0_S5WOP_OFF (5u)

/** \brief Length for Ifx_DMU_HP_PROCON_WOP0_Bits.S6WOP */
#define IFX_DMU_HP_PROCON_WOP0_S6WOP_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_WOP0_Bits.S6WOP */
#define IFX_DMU_HP_PROCON_WOP0_S6WOP_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_WOP0_Bits.S6WOP */
#define IFX_DMU_HP_PROCON_WOP0_S6WOP_OFF (6u)

/** \brief Length for Ifx_DMU_HP_PROCON_WOP0_Bits.S7WOP */
#define IFX_DMU_HP_PROCON_WOP0_S7WOP_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_WOP0_Bits.S7WOP */
#define IFX_DMU_HP_PROCON_WOP0_S7WOP_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_WOP0_Bits.S7WOP */
#define IFX_DMU_HP_PROCON_WOP0_S7WOP_OFF (7u)

/** \brief Length for Ifx_DMU_HP_PROCON_WOP0_Bits.S8WOP */
#define IFX_DMU_HP_PROCON_WOP0_S8WOP_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_WOP0_Bits.S8WOP */
#define IFX_DMU_HP_PROCON_WOP0_S8WOP_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_WOP0_Bits.S8WOP */
#define IFX_DMU_HP_PROCON_WOP0_S8WOP_OFF (8u)

/** \brief Length for Ifx_DMU_HP_PROCON_WOP0_Bits.S9WOP */
#define IFX_DMU_HP_PROCON_WOP0_S9WOP_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_WOP0_Bits.S9WOP */
#define IFX_DMU_HP_PROCON_WOP0_S9WOP_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_WOP0_Bits.S9WOP */
#define IFX_DMU_HP_PROCON_WOP0_S9WOP_OFF (9u)

/** \brief Length for Ifx_DMU_HP_PROCON_WOP0_Bits.S10WOP */
#define IFX_DMU_HP_PROCON_WOP0_S10WOP_LEN (1u)

